/* Написати програму де компютер загадає число від 1 до 10 і запропонує користувачу вгадати його Користувач вводить свій варіант і отримує результат (Виграв чи ні) Вивести результат в форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви програли, компютер загадав (тут варіант компютера)" */

const guessNumber = () => {
    const randomNumber = Math.round(Math.random() * (10 - 1) + 1);
    // alert('Компютер загадав число');
    const userNumber = Number(prompt('Введіть число від 1 до 10'));

    if (userNumber === randomNumber) {
        return alert(`Вітаю ви вгадали число ${randomNumber}`);
    }

    return alert(`Ви програли, компютер загадав ${randomNumber}`);
};

guessNumber();
