// Написати програму яка буде переводити температуру з цельсія в фаренгейти, або навпаки з фаренгейта в цельсії

/* Формула перевода Фаренгейта (°F) в Цельсий (°C) и наоборот Цельсия (°C) в Фаренгейт (°F):

(Фаренгейт — 32) : 1,8 = Цельсий Пример: (50°F - 32) : 1,8 = 10°C
Цельсий х 1,8 + 32 = Фаренгейт Пример: 10°C x 1,8 + 32 = 50°F */

const convertTemperature = (temp, celOrFar) => {
    if (celOrFar === 'f') {
        return (temp - 32) / 1.8 + '°C';
    }

    if (celOrFar === 'c') {
        return temp * 1.8 + 32 + '°F';
    }
};

console.log(convertTemperature(22, 'c'));
